import { QuizCollection, QuizModel } from "./quizSlice";

export class QuizStorrage {
  static get collection(): QuizCollection {
    return {
      test: this.test,
      smi_1: this.smi_1,
      ysq_s3: this.ysq_s3,
    };
  }

  static get test(): QuizModel {
    return {
      title: "test title",
      description: "test descr",
      groups: [
        {
          name: "group 1",
          questions: [
            {
              number: 1,
              value: "first q",
            },
            {
              number: 2,
              value: "second q",
            },
          ],
        },
        {
          name: "group 2",
          questions: [
            {
              number: 3,
              value: "third q",
            },
            {
              number: 4,
              value: "fourth q",
            },
          ],
        },
      ],
    };
  }

  static get ysq_s3(): QuizModel {
    return {
      title: "YSQ – S3",
      description: `<p>Інструкція: Нижче наводяться твердження, які Ви можете використати для опису себе. Будь ласка, прочитайте кожне твердження і оцініть його на основі того, наскільки точно воно відповідає Вам протягом минулого року. Якщо Ви невпевнені щодо найкращого варіанту відповіді, то нехай Ваша відповідь буде ближча до того, що Ви емоційно, аніж раціонально, відчуваєте є більш правдивим.</p>
<p>Кілька пунктів стосуються Ваших відносин з батьками або Ваших романтичних стосунків. Якщо будь-хто з цих людей помер, будь ласка, оцініть ці пункти на основі того, якими були Ваші стосунки, коли ці люди були живі. Якщо в даний момент у Вас немає партнера (романтичних стосунків), але в минулому вони у Вас були, будь ласка, оцініть відповідні пункти на основі Ваших нещодавніх, найбільш важливих для Вас стосунків.</p>
<p>З поданої нижче шкали виберіть найбільш відповідну оцінку по шкалі від 1 до 6, яка найкраще Вас описує, а обрану Вами цифру впишіть у проміжку перед кожним твердженням.</p>`,
      groupsName: "Cхема",
      groups: [
        {
          name: "Емоційної депривації ",
          questions: [
            {
              number: 1,
              value:
                "У мене не було нікого, хто б турбувався про мене, з ким я б міг розділити свій внутрішній світ, хто б щиро цікавився тим, що зі мною відбувається.",
            },
            {
              number: 19,
              value:
                "У моєму житті немає нікого, хто б дарував мені тепло, підтримку і любов.",
            },
            {
              number: 37,
              value:
                "Я не відчував (-ла) у своєму житті, що був (-ла) особливим (-ою) для когось.",
            },
            {
              number: 55,
              value:
                "У мене не було нікого, хто б справді слухав мене, розумів мене або був зацікавлений моїми потребами чи почуттями.",
            },
            {
              number: 73,
              value:
                "У моєму житті поряд зі мною переважно не було сильної чи мудрої людини, яка б могла дати мені добру пораду чи підказку, коли я не був (-ла) впевнений (-а), що робити.",
            },
          ],
        },
        {
          name: "Покинення ",
          questions: [
            {
              number: 2,
              value:
                "Я часто «прилипаю» до близьких мені людей тому, що боюся, що вони покинуть мене.",
            },
            {
              number: 20,
              value:
                "Я настільки потребую інших людей, що переживаю, що можу їх втратити.",
            },
            {
              number: 38,
              value:
                "Я переживаю, що близькі мені люди покинуть мене або відмовляться від мене.",
            },
            {
              number: 56,
              value:
                "Коли хтось, кого я люблю, здавалося би віддаляється від мене, я впадаю у відчай.",
            },
            {
              number: 74,
              value:
                "Інколи я настільки переживаю, що люди покинуть мене, що сам (-а) відкидаю їх першим.",
            },
          ],
        },
        {
          name: "Недовіри/скривдження ",
          questions: [
            {
              number: 3,
              value:
                "Я очікую, що люди використають мене задля власних інтересів.",
            },
            {
              number: 21,
              value:
                "Я відчуваю, що не можу втрачати пильність поряд з іншими людьми, інакше вони навмисно зроблять мені боляче.",
            },
            {
              number: 39,
              value: "Мене обов’язково хтось зрадить, це лиш питання часу.",
            },
            {
              number: 57,
              value: "Я часто маю підозри щодо мотивів інших людей.",
            },
            {
              number: 75,
              value:
                "Зазвичай я шукаю приховані мотиви у діях людей щодо мене.",
            },
          ],
        },
        {
          name: "Соціальної ізоляції/відчуження ",
          questions: [
            {
              number: 4,
              value: "Я ніде «не вписуюся», усюди чуюся чужий, зайвий.",
            },
            {
              number: 22,
              value: "Я абсолютно відрізняюсь від інших людей, я зовсім інший.",
            },
            {
              number: 40,
              value: "Я не належу до жодної групи; я самітник.",
            },
            {
              number: 58,
              value:
                "Я почуваюся відчуженим (-ою), «відрізаним» (-ою) від інших людей.",
            },
            {
              number: 76,
              value: "Я завжди почуваюся поза групою.",
            },
          ],
        },
        {
          name: "Дефективності ",
          questions: [
            {
              number: 5,
              value:
                "Жоден (-на) чоловік/жінка, з якою я хочу бути, не зможе розвивати подальші стосунки і хотіти бути зі мною, якщо дізнається про мої недоліки і вади.",
            },
            {
              number: 23,
              value:
                "Жодна людина, яка мені дуже подобається, не залишилася б поруч зі мною, якби пізнала мене справжнього (-ю).",
            },
            {
              number: 41,
              value: "Я невартий (-на) любові, поваги та уваги від інших.",
            },
            {
              number: 59,
              value: "Я відчуваю, що я невартий любові (-а).",
            },
            {
              number: 77,
              value:
                "Я настільки почуваю себе неприйнятим (-ою), що не можу відкритися перед іншими людьми чи дозволити їм краще себе пізнати.",
            },
          ],
        },
        {
          name: "Некомпетентності та неминучих невдач ",
          questions: [
            {
              number: 6,
              value:
                "Майже нічого з того, що я роблю на роботі (чи в навчанні), я не роблю настільки добре, як інші люди.",
            },
            {
              number: 24,
              value:
                "Якщо оцінювати мою здатність досягати чогось у житті – то я справді некомпетентний (-а).",
            },
            {
              number: 42,
              value:
                "Інші люди є більш здібними від мене у сфері роботи і досягнень.",
            },
            {
              number: 60,
              value: "Я не настільки талановитий (-а) в роботі, як інші люди.",
            },
            {
              number: 78,
              value:
                "Я не настільки розумний (-а), як більшість людей, якщо мова йде про роботу (чи навчання).",
            },
          ],
        },
        {
          name: "Безпорадності/залежності ",
          questions: [
            {
              number: 7,
              value:
                "Я не відчуваю, що здатний (-а) самостійно давати собі раду у повсякденному житті.",
            },
            {
              number: 25,
              value:
                "Я вважаю себе особою, залежною від інших, якщо мова йде про щоденне функціонування.",
            },
            {
              number: 43,
              value:
                "Мені не вистачає практичних знань та вмінь необхідних для щоденного життя.",
            },
            {
              number: 61,
              value:
                "Я не можу покладатися на власні судження в щоденних ситуаціях.",
            },
            {
              number: 79,
              value:
                "Я не маю впевненості у своїй здатності вирішувати проблеми щоденного життя.",
            },
          ],
        },
        {
          name: "Очікування на катастрофу ",
          questions: [
            {
              number: 8,
              value:
                "Я не можу позбутися відчуття, що має трапитись щось погане.",
            },
            {
              number: 26,
              value:
                "Я відчуваю, що катастрофа (природня, кримінальна, фінансова або медична) може трапитись зі мною чи з кимось з близьких мені людей в будь-який момент.",
            },
            {
              number: 44,
              value: "Я переживаю, що на мене хтось нападе.",
            },
            {
              number: 62,
              value:
                "Я переживаю, що можу втратити всі свої гроші і стати дуже бідним або опинитися на вулиці.",
            },
            {
              number: 80,
              value:
                "Я переживаю, що у мене розвивається серйозна хвороба, навіть попри те, що лікарі нічого не виявили при обстеженні.",
            },
          ],
        },
        {
          name: "Злиття/невідокремленості особистої ідентичності ",
          questions: [
            {
              number: 9,
              value:
                "Я не був (-ла) в змозі відокремитись від батьків і стати незалежним від них так, як це зробили у свій час інші мої ровесники.",
            },
            {
              number: 27,
              value:
                "Як мої батьки, так і я, ми маємо тенденцію до того, щоб надмірно перейматися життям та проблемами одні одних.",
            },
            {
              number: 45,
              value:
                "Мені та моїм батькам дуже важко приховувати інтимні подробиці одні від одних, не почуваючись при цьому винними або зрадженими.",
            },
            {
              number: 63,
              value: "Я часто відчуваю, що мої батьки визначають моє життя.",
            },
            {
              number: 81,
              value:
                "Я часто відчуваю, що не маю відокремленої ідентичності від моїх батьків чи від мого партнера.",
            },
          ],
        },
        {
          name: "Підкорення ",
          questions: [
            {
              number: 10,
              value:
                "Я вважаю, що якщо я роблю те, що хочу, то цим самим просто напрошуюсь на неприємності.",
            },
            {
              number: 28,
              value:
                "Я думаю, що в мене немає вибору і я змушений (-а) задовольняти бажання інших, інакше вони розізляться на мене або відкинуть мене.",
            },
            {
              number: 46,
              value:
                "У стосунках я дозволяю іншій особі право приймати остаточне рішення.",
            },
            {
              number: 64,
              value:
                "Я завжди дозволяв (-ла) іншим приймати рішення за мене, тож я і не знаю, чого хочу для себе.",
            },
            {
              number: 82,
              value:
                "Для мене є великою трудністю вимагати, щоб мої права поважали, а також, щоб зважали на мої почуття.",
            },
          ],
        },
        {
          name: "Самопожертви ",
          questions: [
            {
              number: 11,
              value:
                "Вкінці-кінців, зазвичай, на мене лягає турбота про близьких людей.",
            },
            {
              number: 29,
              value:
                "Те, що я турбуюсь про інших більше ніж, про себе, говорить, що я справді є добра людина.",
            },
            {
              number: 47,
              value:
                "Я настільки зайнятий (-а) турботою про інших, що майже не маю часу для себе.",
            },
            {
              number: 65,
              value: "Я завжди вислуховую проблеми інших.",
            },
            {
              number: 83,
              value:
                "Інші люди вважають, що я занадто багато роблю для інших, і недостатньо для себе.",
            },
          ],
        },
        {
          name: "Емоційної інгібіції ",
          questions: [
            {
              number: 12,
              value:
                "Я занадто сором’язливий (-а), щоб показувати свої позитивні почуття до інших (напр., прихильність, турботу).",
            },
            {
              number: 30,
              value: "Мені соромно висловлювати свої почуття до інших.",
            },
            {
              number: 48,
              value:
                "Мені важко бути вільним (-ою) і спонтанним (-ою) поряд з іншими людьми.",
            },
            {
              number: 66,
              value:
                "Я настільки контролюю себе, що люди думають, що я неемоційний (-а) чи нечутливий (-а).",
            },
            {
              number: 84,
              value: "Люди вважають мене емоційно скутим (-ою).",
            },
          ],
        },
        {
          name: "Надвисоких стандартів ",
          questions: [
            {
              number: 13,
              value:
                "Я повинен (-на) бути найкращим (-ою) в тому, що роблю; «друге місце» неприйнятне для мене.",
            },
            {
              number: 31,
              value:
                "Я намагаюсь робити все якнайкраще; мені замало, щоб було просто “достатньо добре”.",
            },
            {
              number: 49,
              value:
                "Для мене дуже важливо належно виконувати всі свої обов’язки.",
            },
            {
              number: 67,
              value:
                "Я відчуваю постійний тиск, що маю чогось досягнути і виконувати добре свою роботу.",
            },
            {
              number: 85,
              value:
                "Я не можу так легко звільнити себе від відповідальності або вибачити собі свої помилки.",
            },
          ],
        },
        {
          name: "Особливого статусу та прав ",
          questions: [
            {
              number: 14,
              value:
                "Я не можу сприйняти, якщо мені хтось відмовляє у моїх проханнях.",
            },
            {
              number: 32,
              value:
                "Я особливий (-а), і тому на мене не поширюється частина обмежень і заборон, які накладаються на інших людей.",
            },
            {
              number: 50,
              value:
                "Я ненавиджу, коли мене обмежують або не дають робити те, що я хочу.",
            },
            {
              number: 68,
              value:
                "Я вважаю, що не повинен (-на) дотримуватись правил чи норм так, як це роблять інші люди.",
            },
            {
              number: 86,
              value:
                "Я вважаю, що те, що можу запропонувати я, є ціннішим від того, що можуть запропонувати інші.",
            },
          ],
        },
        {
          name: "Недостатнього самоконтролю/самодисципліни ",
          questions: [
            {
              number: 15,
              value:
                "Мені важко організувати себе, щоб завершити рутинне або нудне завдання.",
            },
            {
              number: 33,
              value:
                "Якщо я не можу швидко досягнути мети, то розчаровуюсь і відмовляюсь від неї.",
            },
            {
              number: 51,
              value:
                "Мені важко пожертвувати миттєвим задоволенням задля досягнення довготривалої мети.",
            },
            {
              number: 69,
              value:
                "Я не можу змушувати себе робити речі, які не приносять мені задоволення, навіть якщо я знаю, що це заради мого добра.",
            },
            {
              number: 87,
              value: "Мені рідко вдавалося притримуватись мого рішення.",
            },
          ],
        },
        {
          name: "Пошуку визнання ",
          questions: [
            {
              number: 16,
              value:
                "Наявність грошей та знайомств з важливими людьми надають мені почуття власної важливості.",
            },
            {
              number: 34,
              value:
                "Досягнення є більш цінними для мене, якщо їх хтось помічає.",
            },
            {
              number: 52,
              value:
                "Я почуваюсь менш важливим (-ою), якщо не отримую багато уваги від інших.",
            },
            {
              number: 70,
              value:
                "Якщо я виступаю на засіданні або якщо мене представлено у соціальній ситуації, то для мене важливо отримати схвалення і визнання.",
            },
            {
              number: 88,
              value:
                "Похвала і компліменти дають мені відчуття власної цінності.",
            },
          ],
        },
        {
          name: "Негативізму/песимізму ",
          questions: [
            {
              number: 17,
              value: "Навіть якщо все йде добре, я думаю, що це тимчасово.",
            },
            {
              number: 35,
              value:
                "Якщо стається щось добре, я хвилююсь, що після цього може статись щось погане.",
            },
            {
              number: 53,
              value:
                "Неможливо бути надмірно ретельним; майже завжди щось піде не так.",
            },
            {
              number: 71,
              value:
                "Незважаючи на те, як багато я працюю, я боюсь фінансового краху.",
            },
            {
              number: 89,
              value:
                "Я хвилююсь, що неправильне рішення може призвести до катастрофи.",
            },
          ],
        },
        {
          name: "Покарання ",
          questions: [
            {
              number: 18,
              value:
                "Якщо я зроблю помилку або щось прикре станеться через мене, то я тоді повинен бути покараним.",
            },
            {
              number: 36,
              value:
                "Якщо я не стараюсь з усіх сил, мені слід очікувати невдачі.",
            },
            {
              number: 54,
              value:
                "Якщо я не виконую роботу добре, то повинен (-на) нести відповідальність за наслідки.",
            },
            {
              number: 72,
              value:
                "Не має значення, чому я зробив (-ла) помилку; коли я роблю щось не так, то маю за це заплатити.",
            },
            {
              number: 90,
              value: "Я погана людина, яка заслуговує на покарання.",
            },
          ],
        },
      ],
    };
  }

  static get smi_1(): QuizModel {
    return {
      title: "SMI  (Версія 1.1)",
      description: `<p>ІНСТРУКЦІЯ: Нижче наведенні твердження, які особа може використати для опису себе. Будь ласка, оцініть кожне з них, використовуючи подану шкалу, на основі того, як часто загалом Ви вірите у те, про що говориться у твердженнях, або відчуваєте, що це правда.</p> 
<p>ЧАСТОТА: в загальному
<br>1 = ніколи або майже ніколи
<br>4 = часто
<br>2 = рідко
<br>5 = більшість часу
<br>3 = час від часу
<br>6 = весь час</p>`,
      groupsName: "Частка",
      groups: [
        {
          name: "Зранена дитина",
          questions: [
            {
              number: 4,
              value:
                "Я почуваюся абсолютно неповноцінним (-ою) і дефективним (-ою).",
            },
            {
              number: 6,
              value: "Я почуваюся загубленим (-ою), забутим (-ою).",
            },
            {
              number: 34,
              value: "Я у відчаї.",
            },
            {
              number: 48,
              value: "Я почуваюся самотнім (-ьою).",
            },
            {
              number: 63,
              value: "Я почуваюся приниженим (-ою).",
            },
            {
              number: 67,
              value: "Навіть, якщо поруч є люди, я почуваюся самотнім (-ьою).",
            },
            {
              number: 101,
              value:
                "Я часто почуваюся, ніби я один-одинокий (-а) у цьому світі.",
            },
            {
              number: 102,
              value: "Я почуваюся слабким (-ою) і безпомічним (-ою).",
            },
            {
              number: 106,
              value: "Я почуваюся покинутим (-ою) або виключеним (-ою).",
            },
            {
              number: 113,
              value: "Я відчуваю, що мене ніхто не любить.",
            },
          ],
        },
        {
          name: "Зла дитина",
          questions: [
            {
              number: 22,
              value:
                "Якщо я не буду боротися за себе, то мене скривдять або ж моїми потребами простозігнорують.",
            },
            {
              number: 40,
              value:
                "Мене дратує те, що люди намагаються відібрати у мене свободу і незалежність.",
            },
            {
              number: 45,
              value: "Я відчуваю лють по відношенню до інших людей.",
            },
            {
              number: 47,
              value:
                "У мене всередині є багато гніву, який мені потрібно вилити.",
            },
            {
              number: 53,
              value: "Якщо хтось не за мене, тоді він/вона проти мене.",
            },
            {
              number: 59,
              value:
                "Я несу в собі злість на конкретних людей, які колись покинули чи залишили мене. Є хтось, на кого я злий (-а) за те, що він/вона покинув (-ла) мене або відмовився (-лась) відмене.",
            },
            {
              number: 72,
              value:
                "Мене дратує, коли хтось вказує мені, як я маю почуватись або поводитись.",
            },
            {
              number: 75,
              value:
                "Я маю бажання висловити окремим людям все, що я думаю про те, як вони до менеставились у минулому.",
            },
            {
              number: 99,
              value:
                "Мені хочеться накинутися чи навіть завдати болю певній особі за те, що вона вчинилазі мною.",
            },
            {
              number: 105,
              value:
                "У минулому мене зраджували і до мене ставились несправедливо.",
            },
          ],
        },
        {
          name: "Розлючена дитина",
          questions: [
            {
              number: 14,
              value: "У мене бувають неконтрольовані вибухи гніву.",
            },
            {
              number: 24,
              value: "Коли я злюся на людей, то можу їх вдарити.",
            },
            {
              number: 25,
              value:
                "Коли я починаю злитися, то часто не можу контролювати себе і втрачаю самовладання.",
            },
            {
              number: 44,
              value: "В злості я можу кидати та нищити речі, що під рукою.",
            },
            {
              number: 51,
              value:
                "Коли я злюся, то часто втрачаю контроль над собою і можу погрожувати іншим людям.",
            },
            {
              number: 88,
              value:
                "Я можу настільки втратити контроль над собою в пориві злості, що можу навітьпоранити інших людей.",
            },
            {
              number: 94,
              value: "У пориві злості я нищу речі.",
            },
            {
              number: 97,
              value: "Мій гнів виходить з-під контролю.",
            },
            {
              number: 117,
              value:
                "Я можу настільки розізлитися, що відчуваю, ніби можу вбити когось.",
            },
          ],
        },
        {
          name: "Імпульсивна дитина",
          questions: [
            {
              number: 12,
              value: "Мені важко контролювати свої імпульси.",
            },
            {
              number: 15,
              value:
                "Мої імпульсивні дії чи згаряча висловлені емоції приносять мені неприємності аборанять інших людей.",
            },
            {
              number: 33,
              value:
                "Я не можу керувати своїми емоціями і переважно вони визначають мої дії.",
            },
            {
              number: 38,
              value:
                "Я не задумуюсь над тим, що говорю, і це приносить мені неприємності або ранитьінших людей.",
            },
            {
              number: 62,
              value: "Я порушую правила, а потім про це шкодую.",
            },
            {
              number: 65,
              value: "Я спочатку роблю, а потім думаю.",
            },
            {
              number: 74,
              value:
                "Я кажу те, що думаю, і дію імпульсивно, не думаючи про наслідки.",
            },
            {
              number: 93,
              value: "Я не можу контролювати свої імпульси.",
            },
          ],
        },
        {
          name: "Недисциплінована дитина",
          questions: [
            {
              number: 13,
              value:
                "Якщо я не можу досягти мети, то легко знеохочуюсь і здаюсь.",
            },
            {
              number: 21,
              value:
                "Мені не вистарчає самодисципліни для того, щоб у належний спосіб доводити до кінцярозпочаті справи, особливо якщо вони носять рутинний характер і не є надто цікавими та приємними.",
            },
            {
              number: 61,
              value:
                "Я не можу змусити себе робити те, що для мене є неприємним, навіть, якщо я знаю,що це заради мого ж добра.",
            },
            {
              number: 66,
              value: "Я швидко знуджуюсь і втрачаю інтерес до речей.",
            },
            {
              number: 103,
              value: "Я лінивий (-а).",
            },
          ],
        },
        {
          name: "Щаслива дитина",
          questions: [
            {
              number: 2,
              value: "Я почуваюся любленим (-ою) і прийнятим (ою).",
            },
            {
              number: 17,
              value: "Я почуваюся задоволеним (-ою) і спокійним (-ою).",
            },
            {
              number: 19,
              value:
                "Я відчуваю, що маю близький емоційний зв'язок з окремими людьми.",
            },
            {
              number: 46,
              value:
                "Я відчуваю, що я маю місце між інших людей, я один з них.",
            },
            {
              number: 57,
              value:
                "Я відчуваю, що моє життя є досить стабільним і безпечним.",
            },
            {
              number: 64,
              value: "Я маю довіру до переважної більшості людей.",
            },
            {
              number: 91,
              value: "Я почуваюся в безпеці.",
            },
            {
              number: 92,
              value: "Я відчуваю, що мене слухають, розуміють і поважають.",
            },
            {
              number: 108,
              value: "Я оптиміст.",
            },
            {
              number: 116,
              value: "Я спонтанний (-а), веселий (-а) і життєрадісний (-а).",
            },
          ],
        },
        {
          name: "Поступливо-покірна частка",
          questions: [
            {
              number: 8,
              value:
                "Я докладаю великих зусиль, щоб догодити іншим людям та уникнути конфліктів,конфронтації та відкинення.",
            },
            {
              number: 18,
              value:
                "Я часто змінюю свою поведінку і поводжуся так, щоби сподобатися оточуючим мене уданий момент людям.",
            },
            {
              number: 35,
              value: "Я дозволяю іншим людям критикувати або принижувати мене.",
            },
            {
              number: 36,
              value: "У стосунках я дозволяю іншій особі мати керівну роль.",
            },
            {
              number: 52,
              value:
                "Я дозволяю, щоб було так, як хочуть інші люди, жертвуючи при цьому часто своїмипотребами.",
            },
            {
              number: 96,
              value:
                "Я залишаюся пасивним (-ою) навіть тоді, коли мені не подобається, як усе відбуваєтьсянавколо.",
            },
            {
              number: 104,
              value:
                "Я можу терпіти і миритися з будь-чим, що є в людях, які для мене важливі.",
            },
          ],
        },
        {
          name: "Відсторонено-захисна частка",
          questions: [
            {
              number: 27,
              value:
                "Більшість речей, які важливі іншим людям, мене ніяк не заторкують, я чуюся щодо нихвідсторонено.",
            },
            {
              number: 31,
              value:
                "У мене немає почуттів щодо інших людей – мені до всіх доволі байдуже.",
            },
            {
              number: 32,
              value:
                "Я почуваюся відстороненим (-ою) від усього: я не відчуваю контакту з собою, своїмиемоціями чи з іншими людьми.",
            },
            {
              number: 37,
              value: "Я почуваюся відстороненим (-ою) від інших людей.",
            },
            {
              number: 41,
              value: "Я нічого не відчуваю.",
            },
            {
              number: 56,
              value: "Я не хочу входити в ближчі стосунки з іншими людьми.",
            },
            {
              number: 60,
              value: "Я не відчуваю емоційного зв'язку з іншими людьми.",
            },
            {
              number: 71,
              value: "Мені до всього байдуже; ніщо не має для мене значення.",
            },
            {
              number: 84,
              value: "Я почуваюся беземоційним (-ою).",
            },
          ],
        },
        {
          name: "Відсторонено само-заспокоююча частка",
          questions: [
            {
              number: 39,
              value:
                "Я інтенсивно працюю або займаюся спортом, щоб не думати про те, що менезасмучує.",
            },
            {
              number: 49,
              value:
                "Мені потрібно робити щось, що мене стимулює, переключає, відволікає, щоб уникнути зіткнення зі своїми почуттями (наприклад, працювати, грати в азартні ігри, їсти, ходити помагазинах, сексуальна активність чи перегляд телебачення і т.п.).",
            },
            {
              number: 54,
              value:
                "Для того, щоб неприємні думки чи відчуття не турбували мене, я постійно себе чимосьзаймаю.",
            },
            {
              number: 82,
              value:
                "Я хочу відволіктися від думок та почуттів, які мене засмучують.",
            },
          ],
        },
        {
          name: "Само-возвеличуюча частка",
          questions: [
            {
              number: 10,
              value: "Я намагаюся по можливості бути в центрі уваги інших.",
            },
            {
              number: 11,
              value:
                "Я дратуюсь, коли люди не виконують те, що я прошу їх зробити.",
            },
            {
              number: 26,
              value:
                "Для мене важливо бути номером «1» (наприклад, найпопулярнішим, найуспішнішим,найбагатшим, найсильнішим).",
            },
            {
              number: 29,
              value: "Мене не влаштовує друге місце – я маю бути переможцем!",
            },
            {
              number: 42,
              value:
                "Я роблю те, що хочу, незалежно від потреб чи почуттів інших людей.",
            },
            {
              number: 70,
              value:
                "Я почуваюся особливим (-ою) і кращим (-ою) від інших людей.",
            },
            {
              number: 77,
              value: "Я ставлюсь досить критично до інших людей.",
            },
            {
              number: 85,
              value: "Я повинен (-на) бути найкращим (-ою) у всьому, що роблю.",
            },
            {
              number: 87,
              value: "Я вимогливий (-а) по відношенню до інших людей.",
            },
            {
              number: 109,
              value:
                "Я думаю, що правила, за якими живуть більшість людей, не поширюються на мене.",
            },
          ],
        },
        {
          name: "Агресивно-нападаюча частка",
          questions: [
            {
              number: 1,
              value:
                "Я вимагаю поваги до себе і тому я нікому не дозволю вказувати мені, що я маю робити.",
            },
            {
              number: 23,
              value:
                "Якщо ви дозволяєте іншим людям висміювати або залякувати себе, то ви – повнийневдаха.",
            },
            {
              number: 30,
              value: "Напад – це найкращий захист.",
            },
            {
              number: 50,
              value: "Рівності не існує, тому краще бути вищим над іншими.",
            },
            {
              number: 73,
              value:
                "Якщо ви не керуєте іншими людьми, тоді вони керуватимуть вами.",
            },
            {
              number: 89,
              value: "Я сильний і непереможний (-а).",
            },
            {
              number: 95,
              value: "Щоб чутися захищено, треба мати владу над іншими людьми.",
            },
            {
              number: 98,
              value: "Я зневажаю або насміхаюся над іншими людьми.",
            },
            {
              number: 107,
              value: "Я принижую інших.",
            },
          ],
        },
        {
          name: "Караюча батьківська частка",
          questions: [
            {
              number: 3,
              value:
                "Я відмовляю собі у будь-яких приємностях, бо не заслуговую на них.",
            },
            {
              number: 5,
              value:
                "У мене виникає прагнення покарати себе, завдаючи собі болю (наприклад, шляхомнанесення порізів і т.п.).",
            },
            {
              number: 9,
              value: "Я не пробачаю собі своїх помилок чи проступків.",
            },
            {
              number: 16,
              value: "Якщо стається щось погане, то це моя вина.",
            },
            {
              number: 55,
              value: "Якщо я злюсь на інших – то я погана людина.",
            },
            {
              number: 68,
              value:
                "Я не дозволяю собі приємності, які є у житті інших людей, бо я поганий (-а) і незаслужив (-ла) їх.",
            },
            {
              number: 80,
              value: "Я заслуговую на покарання.",
            },
            {
              number: 83,
              value: "Я злий (-а) на себе.",
            },
            {
              number: 90,
              value: "Я погана людина.",
            },
            {
              number: 112,
              value:
                "Я не заслуговую на співчуття, якщо зі мною трапляється щось погане.",
            },
          ],
        },
        {
          name: "Вимоглива батьківська частка",
          questions: [
            {
              number: 7,
              value: "Я дуже суворий (-а) і вимогливий (-а) до себе.",
            },
            {
              number: 43,
              value:
                "Я не дозволяю собі розслаблятись чи розважатись до того часу, поки не виконаю усе,що повинен (-на) зробити.",
            },
            {
              number: 78,
              value:
                "Я знаходжусь під постійним тиском, щоб треба працювати і досягати успіху.",
            },
            {
              number: 79,
              value: "Я намагаюсь не помилятись, інакше я буду докоряти собі.",
            },
            {
              number: 86,
              value:
                "Я жертвую задоволеннями, здоров’ям чи щастям, щоб відповідати вимогам власнихстандартів.",
            },
            {
              number: 100,
              value:
                "Я знаю, що існує «вірно» і «невірно», тому намагаюся все робити «вірно», інакшепочинаю себе критикувати.",
            },
            {
              number: 110,
              value:
                "Я змушую себе бути більш відповідальним (-ою), ніж більшість людей.",
            },
          ],
        },
        {
          name: "Здорова доросла частка",
          questions: [
            {
              number: 20,
              value:
                "Коли виникають проблеми, я намагаюсь вирішити їх по можливості самостійно.",
            },
            {
              number: 28,
              value:
                "Я можу вирішувати більшість проблеми раціонально і при цьому я можу справлятися земоціями, не втрачаючи об'єктивності.",
            },
            {
              number: 58,
              value: "Я знаю, коли варто висловлювати свої емоції, а коли ні.",
            },
            {
              number: 69,
              value:
                "Я заявляю про свої потреби і можу домагатися їх задоволення, але не переходжу прицьому меж потреб інших людей.",
            },
            {
              number: 76,
              value: "Я переважно здатний (-а) сам (-а) турбуватися про себе.",
            },
            {
              number: 81,
              value: "Я можу вчитися, зростати і змінюватися.",
            },
            {
              number: 111,
              value:
                "Я можу постояти за себе, якщо відчуваю, що мене несправедливо критикують, поганоставляться до мене або використовують.",
            },
            {
              number: 114,
              value: "Я думаю, що загалом я хороша людина.",
            },
            {
              number: 115,
              value:
                "При необхідності, я доводжу до кінця нудні та рутинні завдання, щоб завершити те,що є важливим і цінним.",
            },
            {
              number: 118,
              value:
                "У мене добре відчуття того, ким я є і чого потребую, щоб бути щасливим (-ою). ",
            },
          ],
        },
      ],
    };
  }
}
